espressif/esp-mqtt/test/mqtt_utils_host_test/sdkconfig.defaults
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10000
CONFIG_IDF_TARGET="linux"
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
